#  | X |  0  |  1  |   2  |   3  |   4  |    5  |  6   |  >6 |
#  | P | 0,2 | 0,3 | 0,15 |  0,1 |  0,1 |  0,05 | 0,05 |  p  |
# a)
tong  = 0.2 + 0.3 + 0.15 + 0.1 + 0.1 + 0.05 + 0.05      # = 0.05
p = 1 - tong
# 1) Xác định p và tính khả năng công nhân đó mắc từ 3 lỗi trở lên
#   P(3) + P(4) + P(5) + P(6) + P(>6) 
P = 0.3 + 0.1 + 0.05 + 0.05 + 0.05                      # = 0.55
print("Giá trị của p là ", p)
print("Khả năng công nhân đó mắc 3 lỗi trở lên là", P)
# b)
#  | P(Xác suất)   | 0.3 | 0.15 | 0.15 | 0.05 | 0.05 | 
#  | Y(Triệu Đồng) | 10  |   3  |   0  |  -2  |  -4  |  
# Kỳ vọng của Y
E_x = 0.3*10 + 0.15*3 + 0.15*0 + 0.05*(-2) + 0.05*(-4)        # = 3.15
# Phương Sai của Y
# V(X) = [E(X^2)] - [E(X)]^2
E_1 = 10**2 * 0.3   # = 30
E_2 = 3**2 * 0.15   # = 4.5
E_3 = 0**2 * 0.15   # = 0
E_4 = (-2)**2 * 0.05    # = 0.2
E_5 = (-4)**2 * 0.05   # = 0.8

E_6 = (E_x)**2              # = 9.9225

V_X = E_1 + E_2 + E_3 + E_4 + E_5 - E_6
print("Kỳ vọng của Y là ", E_x)
print("Phương sai của Y là ", V_X)